---
title: ModelCurve
classe: Autodesk.Revit.DB.ModelCurve
namespace: Autodesk.Revit.DB
eredita: Autodesk.Revit.DB.CurveElement
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 6
---

# ModelCurve

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean IsReferenceLine { get; }` | `modelCurve.IsReferenceLine` | Boolean |
| `GraphicsStyle Subcategory { get; set; }` | `modelCurve.Subcategory` | GraphicsStyle |
| `TrussCurveType TrussCurveType { get; set; }` | `modelCurve.TrussCurveType` | TrussCurveType |
| `Void ChangeToReferenceLine()` | `modelCurve.ChangeToReferenceLine()` | Void |
| `FamilyElementVisibility GetVisibility()` | `modelCurve.GetVisibility()` | FamilyElementVisibility |
| `Void SetVisibility(FamilyElementVisibility)` | `modelCurve.SetVisibility(visibility)` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```